# IEntryPoint Properties

---
The IEntryPoint type exposes the following members.
| Name| Description
---|---|---
| AddinFolder|
Top
#### Reference
IEntryPoint Interface
Autodesk.Revit.DB.Macros Namespace